### 03_writing_fucntions_create function project_challenege

In [8]:
import pandas as pd

The function should
- Accept a single year as input value
- construct a valid file path
- read in the corresponding names dataset
- define the correct column index for the data set
- output the dataset as a pandas dataframe

#### accept a single year as input value

In [9]:
year = input('Type year: ')

Type year: 1991

#### construct a valid file path & read in the corresponding names dataset

In [ ]:
# def make_path(year):
#     path = f'./data/yob{year}.txt'
#     return path

In [12]:
def parse_dataset(year):
    
    path = f'../data/yob{year}.txt'
    df = pd.read_csv(path, names = ['name','gender','frequency'])

    return df

#### output the dataset as a pandas dataframe

In [13]:
dataset_output = parse_dataset(year)
df = pd.DataFrame(dataset_output)
df

           name gender  frequency
0        Ashley      F      43480
1       Jessica      F      43397
2      Brittany      F      29090
3        Amanda      F      28895
4      Samantha      F      25647
...         ...    ...        ...
25108      Zeev      M          5
25109      Zein      M          5
25110    Zerick      M          5
25111    Zeshan      M          5
25112    Zuhair      M          5

[25113 rows x 3 columns]

###  04_methods_project_challenege

#### Total number of babys in specific years

In [ ]:
#sum of babies for a specific year
sum_babies = dataset_output.sum()['frequency']
print(f'Total number of babies in {year} = {sum_babies}')

#### code to combine datasets for analysis

In [14]:
#create an empty df
df_final = pd.DataFrame(columns = ['name','gender','frequency']) 

for year in range(1880,2023):
    df_temp = parse_dataset(year)
    df_temp['year'] = year
    df_final = pd.concat([df_final,df_temp], ignore_index = True)

In [15]:
df_final

              name gender frequency    year
0             Mary      F      7065  1880.0
1             Anna      F      2604  1880.0
2             Emma      F      2003  1880.0
3        Elizabeth      F      1939  1880.0
4           Minnie      F      1746  1880.0
...            ...    ...       ...     ...
2085153     Zuberi      M         5  2022.0
2085154       Zydn      M         5  2022.0
2085155      Zylon      M         5  2022.0
2085156     Zymeer      M         5  2022.0
2085157    Zymeire      M         5  2022.0

[2085158 rows x 4 columns]

#### saving the data file

In [19]:
df_final.to_csv('../data/baby_names_all_years.csv', index=False)

In [21]:
df_final.sort_values(by='frequency').max()

name          Zzyzx
gender            M
frequency     99693
year         2022.0
dtype: object